src/cf/maERP_ib/src/Documents/НалоговаяНакладная/НалоговаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НалоговаяНакладная</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнвойса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСпособыОплаты</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДенежныхСредств</name>
      <type>
        <types>CatalogRef.TypesDePayment</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Чек</name>
      <type>
        <types>CatalogRef.БанковскиеЧеки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/maERP_ib/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/maERP_ib/src/InformationRegisters/КураторыДоговоров/КураторыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КураторыДоговоров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/Documents/НалоговаяНакладная/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		РаботаСДокументами.МожноСоздатьДокументНаОсновании(Метаданные.Документы.РеализацияТоваровУслуг, ДанныеЗаполнения);
		Дата = ТекущаяДатаСеанса();
		Основание = ДанныеЗаполнения;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Менеджер = ДанныеЗаполнения.Менеджер;
		//ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		Рез = Документы.ЗаказПокупателя.ПолучитьТоварыПоГруппировкам(ДанныеЗаполнения);
		ВыбГруппа = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыбГруппа.Следующий() Цикл
			Выб = ВыбГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выб.Следующий() Цикл
	        	СтрОснование = ДанныеЗаполнения.ТЧТовары.Найти(Выб.КодСтроки, "КодСтроки");
				НС = ТЧТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НС, СтрОснование);
			КонецЦикла;	
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Истина); 
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		Основание = ДанныеЗаполнения;		
		//ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		ТЧСерии.Загрузить(ДанныеЗаполнения.ТЧСерии.Выгрузить());
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Организация = ?(ДанныеЗаполнения.Организация.ОсновнойУчет,ДанныеЗаполнения.Организация,ДанныеЗаполнения.Организация.ВедущаяОрганизация);
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор; 
		МестоХранения = ?(ДанныеЗаполнения.Организация.ОсновнойУчет,ДанныеЗаполнения.МестоХранения,ДанныеЗаполнения.Организация.ВедущаяОрганизация.ОсновнойСклад);
		Основание = ДанныеЗаполнения;		
		//ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		ТЧСерии.Загрузить(ДанныеЗаполнения.ТЧСерии.Выгрузить());
		ТЗТовары = ТЧТовары.Выгрузить();
		ТЗТовары.ЗаполнитьЗначения(ДанныеЗаполнения,"ОтгрузкаТовара");
		ТЧТовары.Загрузить(ТЗТовары);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));
	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	//УправляемыеБлокировки.ВзаиморасчётыСПокупателями(Блокировка, Контрагент);

	Блокировка.Заблокировать();
	// Формируем
	Отказ = Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	Если Отказ Тогда Возврат КонецЕсли;
	РегистрыНакопления.ДенежныеСредстваОрганизаций.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	//РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьПоДопРасходам(ЭтотОбъект);
	//РегистрыНакопления.Продажи.СформироватьДвижения(ЭтотОбъект); // Рассчитывается на основании списанных партий и издержек
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	РаботаСДокументами.МожноСоздатьДокументНаОсновании(Метаданные.Документы.РеализацияТоваровУслуг, Основание);
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	Менеджер = РегистрыСведений.КураторыДоговоров.ПолучитьПоследнее(ЭтотОбъект.Дата, Новый Структура("Договор", ЭтотОбъект.Договор)).Куратор;
	//РаботаСДокументами.ПроверкаСоответствияВозвратовРеализации(ЭтотОбъект, РежимЗаписи, Отказ);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	Если Не ЗначениеЗаполнено(ДатаИнвойса) Тогда 
		ДатаИнвойса = Дата;
	КонецЕсли;
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры
